Repository: quoctrieu04/chitieu
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Spending
vi: Chi Tiêu

# tabBudgets
source: Budgets
vi: Ngân sách

# tabAccounts
source: Accounts
vi: Tài khoản

# tabAnalytics
source: Analytics
vi: Phân tích

# tabSettings
source: Settings
vi: Cài đặt

# settingsTitle
source: Settings
vi: Cài đặt

# userNamePlaceholder
source: Guest
vi: Khách

source: Language
vi: Ngôn ngữ

# themeLight
source: Light
vi: Sáng

# themeDark
source: Dark
vi: Tối

# brightness
source: Light / Dark
vi: Sáng / Tối

# color
source: Theme color
vi: Màu chủ đạo

source: Font size
vi: Cỡ chữ

# fontSmall
source: Small
vi: Nhỏ

# fontNormal
source: Normal
vi: Bình thường

# fontLarge
source: Large
vi: Lớn

source: Change password
vi: Đổi mật khẩu

# policy
source: Policy & Security
vi: Điều lệ & Bảo mật

source: View
vi: Xem

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

# logoutSuccess
source: Signed out
vi: Đã đăng xuất

# budgetsTitle
source: Monthly budget
vi: Ngân sách tháng

# budgetsDescription
source: Manage limits and spending categories.
vi: Quản lý hạn mức và các hạng mục chi tiêu.

# accountsTitle
source: Accounts
vi: Tài khoản

# accountsDescription
source: Link bank accounts, e-wallets and view current balances.
vi: Liên kết ngân hàng, ví điện tử và số dư hiện tại.

# analyticsTitle
source: Analytics
vi: Phân tích

# analyticsDescription
source: View your spending and budget analysis
vi: Xem phân tích chi tiêu và ngân sách

# loginPassword
source: Password
vi: Mật khẩu

# loginSubmit
source: Sign in
vi: Đăng nhập

source: Total assets
vi: Tổng tiền

source: Payment
vi: Thanh toán

source: Tracking
vi: Theo dõi

source: Create wallet
vi: Tạo khoản thu

source: Transaction history
vi: Lịch sử giao dịch

source: View all
vi: Xem tất cả

# startAddingMoneyTitle
source: Start adding money to your wallets!
vi: Hãy bắt đầu thêm khoản thu tháng này của bạn!

# startAddingMoneyHint
source: The more accurate your input, the more accurate the analytics will be!
vi: Bạn nhập càng chính xác thì ứng dụng sẽ giúp bạn tính toán dữ liệu càng chuẩn!

# readyMoneyShort
source: Ready money...
vi: Tiền sẵn sàng để...

source: Opening balance
vi: Số dư khởi điểm

source: Monthly
vi: Tiền tháng

source: Monthly (closed)
vi: Tiền tháng (đã đóng)

source: Travel (deleted)
vi: Du lịch (đã xoá)

source: No description
vi: Không có mô tả

source: Cash
vi: Tiền mặt

# accountsStartTitle
source: Start adding money to your wallet!
vi: Hãy bắt đầu thêm nguồn thu của bạn!

# accountsStartHint
source: The more accurate your input is, the better the app can calculate and analyze your data!
vi: Bạn nhập càng chính xác thì ứng dụng sẽ giúp bạn tính toán dữ liệu thông tin càng chuẩn!

# noTransactionsHint
source: No transactions yet. Start recording your first expense!
vi: Chưa có giao dịch nào. Hãy bắt đầu ghi chép chi tiêu đầu tiên của bạn!

# monthBadge
source: Monthly
vi: Tiền tháng

# noteAddDescription
source: Add description...
vi: Thêm mô tả...

source: Money out
vi: Tiền ra

source: Money in
vi: Tiền vào

source: Category
vi: Danh mục

source: Wallet name
vi: Khoản thu

source: Initial amount
vi: Số tiền ban đầu

# requiredField
source: Required
vi: Không được để trống

source: Invalid number
vi: Số không hợp lệ

source: Save
vi: Lưu

source: Wallet created
vi: Đã thêm nguồn thu

source: Need login
vi: Cần đăng nhập

# needLoginContent
source: You need to log in to create a wallet.
vi: Bạn cần đăng nhập.

# needLoginBudgets
source: You need to log in.
vi: Bạn cần đăng nhập

source: Cancel
vi: Hủy

# somethingWrong
source: Something went wrong, please try again
vi: Đã có lỗi xảy ra, vui lòng thử lại

# noData
source: No data available
vi: Chưa có dữ liệu

# moneyAssigned
source: Assigned
vi: Đã phân bổ

# moneyUnassigned
source: Unassigned
vi: Chưa phân bổ

# assignMoneyCta
source: Assign money
vi: Phân bổ tiền

# trialReminderTitle
source: Choose your trial plan
vi: Chọn gói trial của bạn

# trialReminderSubtitle
source: Choose your trial plan before {date} to avoid service interruption!
vi: Chọn gói trial của bạn trước ngày {date} để không gián đoạn sử dụng app!

# viewPackagesCta
source: View packages
vi: Xem các gói

# createCategoryTitle
source: Catalog
vi: Danh mục

# createCategoryDescription
source: Group your spending by category to easily track where your money goes.
vi: Nhóm các khoản chi theo danh mục để dễ dàng theo dõi tiền đi đâu.

# createFromSuggested
source: Create from suggested list
vi: Tạo từ danh mục gợi ý

# createMyOwn
source: Create my own category
vi: Tạo danh mục của tôi

# budgetSettingsTitle
source: Budget settings
vi: Cài đặt Ngân sách

source: Currency
vi: Tiền tệ

source: Number format
vi: Định dạng số tiền

source: Currency symbol position
vi: Vị trí Ký hiệu Tiền tệ

# symbolBefore
source: Before amount
vi: Trước số tiền

# symbolAfter
source: After amount
vi: Sau số tiền

# monthGridLabel
source: Month {month}
vi: {month}

source: Remaining
vi: Còn lại

# editAllocationCta
source: Edit allocation
vi: Chỉnh sửa phân bổ

# goalTitle
source: Set a goal
vi: Đặt mục tiêu

# goalSubtitle
source: Reach your financial dreams by setting a savings goal.
vi: Hãy đạt được ước mơ tài chính bằng cách đặt mục tiêu tiết kiệm.

# createGoalCta
source: Create a goal
vi: Tạo mục tiêu

# txHistoryTitle
source: Transaction history
vi: Lịch sử giao dịch

# txSpentTotal
source: Total spent: {amount}
vi: Đã chi tổng cộng: {amount}

# monthlyBudgetTitle
source: Monthly Budget
vi: Ngân sách tháng

# viewPlansCta
source: View plans
vi: Xem gói

# groupRequiredCosts
source: Required costs
vi: Danh mục chi tiêu

# categoryRent
source: Rent
vi: Tiền nhà

source: Spent
vi: Đã tiêu

# ofTotal
source: of
vi: trên

# addCategoryTooltip
source: Add category
vi: Thêm danh mục

# createCategoryTitleForm
source: Create a new category
vi: Tạo danh mục mới

# selectIconLabel
source: Select an icon
vi: Chọn biểu tượng

# categoryNameLabel
source: Category name
vi: Tên danh mục

# categoryNameHint
source: Enter a name (e.g., Rent, Food...)
vi: Nhập tên (ví dụ: Tiền nhà, Ăn uống...)

# categoryNameRequired
source: Please enter a category name
vi: Vui lòng nhập tên danh mục

# saveCta
source: Save
vi: Lưu

# cancelCta
source: Cancel
vi: Huỷ

# noCategoryHint
source: No categories yet. Tap + to create your first one.
vi: Chưa có danh mục. Nhấn nút + để tạo danh mục đầu tiên.

# editBudgetTitle
source: Edit budget
vi: Chỉnh sửa ngân sách

# createCategoryGroupCta
source: CREATE CATEGORY GROUP
vi: TẠO DANH MỤC

# reorderDeleteCategoriesCta
source: REORDER/DELETE CATEGORIES
vi: SẮP XẾP/XÓA DANH MỤC

# renameCta
source: RENAME
vi: SỬA TÊN

# loginRequiredMessage
source: Please log in to create a category
vi: Vui lòng đăng nhập để tạo danh mục

# editCategoryTitle
source: Edit category
vi: Sửa danh mục

# updateCta
source: Update
vi: Cập nhật

# allocateTitle
source: Allocate Money to Budgets
vi: Phân chia tiền vào ngân sách

# availableNow
source: Available
vi: Đang có

source: Allocated
vi: Đã phân bổ

source: SAVE ALL ALLOCATIONS
vi: LƯU TẤT CẢ PHÂN BỔ

source: Remaining to allocate
vi: Còn lại chưa phân bổ

# inputAllocateTitle
source: Enter the amount to allocate
vi: Nhập số tiền muốn phân bổ

# moneyInputHint
source: e.g. 500000
vi: Ví dụ: 500000

source: Available
vi: Đang có

# spentLabel
source: Spent:
vi: Đã tiêu:

# enterAmountTitle
source: Enter amount to allocate
vi: Nhập số tiền muốn phân bổ

# hintAmountExample
source: e.g., 30,000
vi: Ví dụ: 30.000

source: Remaining unallocated:
vi: Còn lại chưa phân bổ:

# errorGeneric
source: Something went wrong. Please try again.
vi: Đã xảy ra lỗi. Vui lòng thử lại.

source: Category details
vi: Chi tiết danh mục

source: Category name
vi: Tên danh mục

# assignedMoney
source: Assigned amount
vi: Số tiền phân bổ

source: Saved
vi: Đã lưu

source: Delete
vi: Xoá

# areYouSureDelete
source: Are you sure you want to delete this category?
vi: Bạn có chắc muốn xoá danh mục này?

# fieldRequired
source: This field is required
vi: Vui lòng nhập thông tin

# numberInvalid
source: Invalid number
vi: Số không hợp lệ

# mustBePositive
source: Must be a non-negative number
vi: Phải là số không âm

source: Too long
vi: Quá dài

# analyticsBudgetSplit
source: Budget allocation by category
vi: Phân bổ theo danh mục

source: Top categories
vi: Danh mục nổi bật

source: Summary
vi: Tổng kết

# noDataThisMonth
source: No data for this month
vi: Không có dữ liệu cho tháng này

source: Select month
vi: Chọn tháng

source: Total assigned
vi: Tổng phân bổ
